CSI API ETABS v1
cAnalysisResultsSetup.SetOptionBucklingMode Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOptionBucklingMode(
	int BuckModeStart,
	int BuckModeEnd,
	bool BuckModeAll = false
)
Function SetOptionBucklingMode (
	BuckModeStart As Integer,
	BuckModeEnd As Integer,
	Optional BuckModeAll As Boolean = false
) As Integer
Dim instance As cAnalysisResultsSetup
Dim BuckModeStart As Integer
Dim BuckModeEnd As Integer
Dim BuckModeAll As Boolean
Dim returnValue As Integer
returnValue = instance.SetOptionBucklingMode(BuckModeStart,
	BuckModeEnd, BuckModeAll)
int SetOptionBucklingMode(
	int BuckModeStart,
	int BuckModeEnd,
	bool BuckModeAll = false
)
abstract SetOptionBucklingMode :
        BuckModeStart : int *
        BuckModeEnd : int *
        ?BuckModeAll : bool
(* Defaults:
        let _BuckModeAll = defaultArg BuckModeAll false
*)
-> int
Parameters
BuckModeStart
Type: System.Int32
BuckModeEnd
Type: System.Int32
BuckModeAll (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace